app/controllers/client_controller.rb

SELECT * FROM `clients`
---
  def index
    @clients = Client.all

SELECT * FROM `clients` WHERE (`clients`.`id` = 3)
---
  def show
    @client = Client.find(params[:id])

SELECT * FROM `clients` WHERE (`clients`.`id` = 3)
---
  def edit
    @client = Client.find(params[:id])

INSERT INTO `clients` (`name`, `created_at`, `updated_at`, `bio`) VALUES(NULL, '2011-02-20 22:28:28', '2011-02-20 22:28:28', NULL)
---
  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save

SELECT * FROM `clients` WHERE (`clients`.`id` = 3)
UPDATE `clients` SET `bio` = 'Blah', `updated_at` = '2011-02-20 22:31:03', `name` = 'HelloWorld' WHERE `id` = 3
---
  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])

SELECT * FROM `clients` WHERE (`clients`.`id` = 2)
DELETE FROM `clients` WHERE `id` = 2
---
  def destroy
    @client = Client.find(params[:id])
    @client.destroy